Revit 2024 API
FabricationServiceSettings Class
 Represents the settings related to the fabrication services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class FabricationServiceSettings : Element
Visual Basic
Public Class FabricationServiceSettings _
	Inherits Element
Visual C++
public ref class FabricationServiceSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FabricationServiceSettings
See Also
FabricationServiceSettings Members
Autodesk.Revit.DB Namespace